{
  "2025-10-01": {
    "date": "2025-10-01",
    "title": "Invasive 2: Getaway",
    "cover": "https://image.tmdb.org/t/p/w500/srCT9hamJf1bbU9DULYIsc4UEpF.jpg",
    "synopsis": "Kay survived once. Now, trapped on a secluded island, she and her father face a deadly new hunt."
  },
  "2025-10-02": {
    "date": "2025-10-02",
    "title": "Alligator II: The Mutation",
    "cover": "https://image.tmdb.org/t/p/w500/lRJgV0tDiGjPLZWvEGySgpleyJk.jpg",
    "synopsis": "A giant mutated alligator runs riot in a small town after the sewer system washes it into a lake."
  },
  "2025-10-03": {
    "date": "2025-10-03",
    "title": "Puppet Master II",
    "cover": "https://image.tmdb.org/t/p/w500/dy5tzZFWFTjbNyG4KNP6yMjZ6l9.jpg",
    "synopsis": "A new team of paranormal researchers has come to the hotel to investigate its murder-soaked past; the puppets -- led by a new member, Torch -- shed some light on the matter, as they tunnel, burn, strangle and hook to survive."
  },
  "2025-10-04": {
    "date": "2025-10-04",
    "title": "10/31: Part II (anthology)",
    "synopsis": "Synopsis pending."
  },
  "2025-10-05": {
    "date": "2025-10-05",
    "title": "The Stalker: Part II",
    "cover": "https://image.tmdb.org/t/p/w500/7iPSTB6vcK0Q7TnAgMJrLZOsfEQ.jpg",
    "synopsis": "What happens when revenge has mutated into a type of madness?"
  },
  "2025-10-06": {
    "date": "2025-10-06",
    "title": "Stake Land II",
    "cover": "https://image.tmdb.org/t/p/w500/3K9sca6hMxVzCtE7EnAxTjdKWpM.jpg",
    "synopsis": "When his home of New Eden is destroyed by a revitalized Brotherhood and its new Vamp leader, Martin finds himself alone in the badlands of America with only the distant memory of his mentor and legendary vampire hunter, Mister, to guide him."
  },
  "2025-10-07": {
    "date": "2025-10-07",
    "title": "Manos Returns",
    "cover": "https://image.tmdb.org/t/p/w500/1yGqTs7jOAJKEceJeeQt5CTMoOD.jpg",
    "synopsis": "Four friends are lost on a road trip, finding the house of a hidden cult that worships a being named Manos. They are led by the Master and his loyal servant, Torgo."
  },
  "2025-10-08": {
    "date": "2025-10-08",
    "title": "Massacre II",
    "cover": "https://image.tmdb.org/t/p/w500/1ASsLiM9gENjnigcrAczBTetQ66.jpg",
    "synopsis": "Two college students driving coast to coast are lured off the main highway and onto a deserted Texas road. Here they are stalked by the menacing Leatherface and his demented family...a bizarre cannibalistic clan with blood on their hands and a feast on their minds. The students’ only chance for escape is a survivalist with enough firepower to blast Leatherface and the rest of the grisly predators to hell. A depraved shocker of intense terror from the gruesome beginning to the bloody finish."
  },
  "2025-10-09": {
    "date": "2025-10-09",
    "title": "Grizzly II: Revenge",
    "cover": "https://image.tmdb.org/t/p/w500/6Soee8ehw0V5pd6fAvMKJJkXPqa.jpg",
    "synopsis": "All hell breaks loose when a giant grizzly, reacting to the slaughter of her cubs by poachers, attacks a massive rock concert in the National Park.  [This sequel to \"Grizzly\" (1976) was left unfinished after production wrapped prematurely in 1983, and was not officially released until 2020, though a bootleg workprint version had been in circulation for some years prior to this.]"
  },
  "2025-10-10": {
    "date": "2025-10-10",
    "title": "Leprechaun 2",
    "cover": "https://image.tmdb.org/t/p/w500/fnCLZ3rpy3enYSHrzcBxnx3fozK.jpg",
    "synopsis": "A thousand years ago, the Leprechaun left a bloody trail when he ripped through the countryside in search of his stolen gold. Now he's back in the big city using all of his deadly tricks to snare the girl of his nightmares. His bloody quest becomes more deadly when her boyfriend steals one of the Leprechaun's gold coins. The town soon discovers two dead bodies and a trail of gold dust leads them to the Leprechaun's lair."
  },
  "2025-10-11": {
    "date": "2025-10-11",
    "title": "The Toxic Avenger: Part II",
    "cover": "https://image.tmdb.org/t/p/w500/m5o7B3VSAjvinjtSYxXD38senvb.jpg",
    "synopsis": "Melvin Junko was a nerdy weakling until he fell into a vat of toxic waste, turning him into the first ever superhuman creature from New Jersey. This time, he takes on Tokyo."
  },
  "2025-10-12": {
    "date": "2025-10-12",
    "title": "Poltergeist II: The Other Side",
    "cover": "https://image.tmdb.org/t/p/w500/2r22KqmzWV48kF02GN78NaS3q0m.jpg",
    "synopsis": "The Freeling family move in with Diane's mother in an effort to escape the trauma and aftermath of Carol Anne's abduction by the Beast. But the Beast is not to be put off so easily and appears in a ghostly apparition as the Reverend Kane, a religious zealot responsible for the deaths of his many followers. His goal is simple - he wants the angelic Carol Anne."
  },
  "2025-10-13": {
    "date": "2025-10-13",
    "title": "Species II",
    "cover": "https://image.tmdb.org/t/p/w500/8LSBi0bHACZtIiVErUBQ2UXNYLA.jpg",
    "synopsis": "Having just returned from a mission to Mars, Commander Ross isn't exactly himself. He's slowly becoming a terrifying alien entity with one goal -- to procreate with human women! When countless women suffer gruesome deaths after bearing half-alien offspring, scientist Laura Baker and hired assassin Press Lennox use Eve, a more tempered alien clone, to find Ross and his brood. Before long Eve escapes to mate with Ross."
  },
  "2025-10-14": {
    "date": "2025-10-14",
    "title": "XTRO 2: The Second Encounter",
    "cover": "https://image.tmdb.org/t/p/w500/rKAViKJOJYwcFYA7SjvTSKwxlvE.jpg",
    "synopsis": "An underground government facility is locked down by its A.I.-controlled computer when an alien entity travels through a dimensional portal and threatens the lives of everybody inside."
  },
  "2025-10-15": {
    "date": "2025-10-15",
    "title": "Psycho Cop Returns",
    "cover": "https://image.tmdb.org/t/p/w500/kWCAJMEHEwGgmgHCO2MPg8p7lnU.jpg",
    "synopsis": "A group of office workers decide to have a party in the office building. Among other things, they want to have some drugs there. Their conversation on the subject is overheard by Joe Vickers, which is rather unfortunate for them, since Joe Vickers is a policeman. Even more unfortunate is the fact that Vickers is also an undead psychotic satanist, and instead of arresting them, he will make sure that nobody leaves the party alive..."
  },
  "2025-10-16": {
    "date": "2025-10-16",
    "title": "Ghoulies II",
    "cover": "https://image.tmdb.org/t/p/w500/1UlogpztvssNEjdIfs1MUiD0xM0.jpg",
    "synopsis": "Ghoulies II picks up a short time after the first movie, a few of the little nasties stow away on an amusement park ride and bring big bucks to a dying fair. The creatures are mad after an attempt to kill them, so the creatures go on a rampage through the fairgrounds, ultimately leading to an explosive conclusion!"
  },
  "2025-10-17": {
    "date": "2025-10-17",
    "title": "Brahms: The Boy II",
    "cover": "https://image.tmdb.org/t/p/w500/swTC1DSZcvdxTOzmAKrtoUUPiDW.jpg",
    "synopsis": "After a family moves into the Heelshire Mansion, their young son soon makes friends with a life-like doll called Brahms."
  },
  "2025-10-18": {
    "date": "2025-10-18",
    "title": "Dementia: Part II",
    "cover": "https://image.tmdb.org/t/p/w500/5kmcqNFpwLXkWu8ajhjcjlHQ0bA.jpg",
    "synopsis": "When an ex-con takes a job as a handyman for an unstable elderly woman to avoid a parole violation, it becomes a choice he may regret."
  },
  "2025-10-19": {
    "date": "2025-10-19",
    "title": "Butchers Book Two: Raghorn",
    "cover": "https://image.tmdb.org/t/p/w500/uSLYBuDTHpTAJI9vcm2brMu4J9H.jpg",
    "synopsis": "Book one followed a family of sadistic butchers, living in the backcountry, who see anyone that crosses their path as dead meat. In “Butchers Book Two: Raghorn,” the story continues when an accident leaves the captors in the hands of brutal cannibals who plan to hack them up for meat."
  },
  "2025-10-20": {
    "date": "2025-10-20",
    "title": "Sleepaway Camp II",
    "cover": "https://image.tmdb.org/t/p/w500/gupBz1S1TCxH75qW4qoqjpeEgQ9.jpg",
    "synopsis": "Angela Baker escapes from a mental hospital and surfaces at a summer camp as a counselor who lectures her teenage charges on proper moral behavior. Those teens who break her strict rules -- from the camp chatterbox or a sex-obsessed girl to the boys who are peeping Toms -- are murdered by the impostor in various gruesome ways. As more campers go missing, intrepid counselor Molly begins to piece together the truth."
  },
  "2025-10-21": {
    "date": "2025-10-21",
    "title": "Day of the Dead 2: Contagium",
    "cover": "https://image.tmdb.org/t/p/w500/t252aGIBEpofDvQc2Imyom4IS8v.jpg",
    "synopsis": "In 1968, in the Ravenside Military Hospital in a military facility in Pennsylvania, the army loses control of an experiment of a lethal bacteriologic weapon that changes the DNA and transforms human beings into zombies. A group of soldiers is sent to the hospital to eliminate the infected staff and interns but private DeLuca steals a test tube with the virus and hides it inside a vacuum flask. He is transformed into a zombie and killed but the vacuum flask falls in the grass. In the present days, a group of patients in the mental institution Ravenside Memorial Hospital finds the vacuum flask and later when one of them opens the vessel, the culture tube drops on the floor of a bathroom contaminating the group and their Dr. Donwynn."
  },
  "2025-10-22": {
    "date": "2025-10-22",
    "title": "Return to Return to Nuke ‘Em High (Vol. 2)",
    "cover": "https://image.tmdb.org/t/p/w500/2YC1JNgGGHrCXDT83UCpdcWLFmV.jpg",
    "synopsis": "Following the events of Volume 1,  the mutated glee club continue their violent rampage in Tromaville. Chrissy and Lauren, two innocent lesbian lovers, must fight not only the Cretins, mutants, and monsters but also the evil Tromorganic Foodstuffs Conglomerate. Can they, and Kevin the Wonder Duck, save Tromaville High School and the world?"
  },
  "2025-10-23": {
    "date": "2025-10-23",
    "title": "Zoombies 2",
    "cover": "https://image.tmdb.org/t/p/w500/i60pYN5dgct0oQCTuh7cpKRYw5G.jpg",
    "synopsis": "A game ranger arresting poachers ends up saving their lives when zombie animals attack them in the jungle. Now surrounded, the game ranger and poachers forge uneasy alliance to stop the beasts before the super-zombie virus spreads to entire world."
  },
  "2025-10-24": {
    "date": "2025-10-24",
    "title": "Insidious Chapter 2",
    "cover": "https://image.tmdb.org/t/p/w500/w5JjiB3O1CLDXbTJe1QpU5RHmlU.jpg",
    "synopsis": "The haunted Lambert family seeks to uncover the mysterious childhood secret that has left them dangerously connected to the spirit world."
  },
  "2025-10-25": {
    "date": "2025-10-25",
    "title": "Texas Chainsaw Massacre Part 2",
    "cover": "https://image.tmdb.org/t/p/w500/cO1Dvg7k87lHSPOdumn3ddJEKdX.jpg",
    "synopsis": "A radio host is victimized by the cannibal family as a former Texas marshal hunts them."
  },
  "2025-10-26": {
    "date": "2025-10-26",
    "title": "Grotesque 2",
    "cover": "https://image.tmdb.org/t/p/w500/g1oTHXBnotOidGHoJPeiLVwjkSA.jpg",
    "synopsis": "Mildred Moyer is at it again, unleashing her unique brand of vengeance on a corrupt religious organization that took advantage of her and others."
  },
  "2025-10-27": {
    "date": "2025-10-27",
    "title": "The Barn: Part II",
    "cover": "https://image.tmdb.org/t/p/w500/jfpXnknnHbqyFoVUTMlBddtOwL2.jpg",
    "synopsis": "The Halloween ban is now lifted in Helen's Valley, and the sorority girls of Gamma Tau Psi place Michelle in charge of their annual haunted house. Unfortunately for Michelle some uninvited trick or treaters from her past come knocking."
  },
  "2025-10-28": {
    "date": "2025-10-28",
    "title": "The Rage: Carrie 2",
    "cover": "https://image.tmdb.org/t/p/w500/jJmIf22gwwQPAFJfZ6Tr1MwSpRg.jpg",
    "synopsis": "Following the suicide of her only friend, outcast teen Rachel Lang's life begins a downward spiral that will not only affect her but take everyone around her down in horrifying fashion."
  },
  "2025-10-29": {
    "date": "2025-10-29",
    "title": "ChromeSkull: Laid to Rest 2",
    "cover": "https://image.tmdb.org/t/p/w500/vZSoi9OyOXKoHRevs2T28tZ1Lfz.jpg",
    "synopsis": "After his gruesome encounter with a girl, and being outmatched by his own assistant, ChromeSkull resurges with a horrifying massacre of his own."
  },
  "2025-10-30": {
    "date": "2025-10-30",
    "title": "Ouija Shark 2",
    "cover": "https://image.tmdb.org/t/p/w500/4DY5LRO2Kc3rp2VvDoKBei0EZQc.jpg",
    "synopsis": "When the Ouija Shark emerges from hell to cause havoc once more on earth, a sorcerer with a history of fighting the ghostly great white must follow it into a multiverse hellscape for one final battle. But this time he is bringing along some friends to help send the shark into oblivion."
  },
  "2025-10-31": {
    "date": "2025-10-31",
    "title": "Terrifier 2",
    "cover": "https://image.tmdb.org/t/p/w500/qEAlwXbYk6IHA4ztoS2XFFaa7Xo.jpg",
    "synopsis": "A year after the Miles County massacre, Art the Clown is resurrected by a sinister entity. Art returns home, where he must hunt down and destroy teenage Sienna and her younger brother Jonathan on Halloween. As the body count rises, the siblings fight to stay alive while uncovering the true nature of Art's evil intent."
  }
}